{
    "title": "Unhappy apartment search",
    "name": "Planning a birthday party",
    "version": 1,
    "api_names": ["apartment_search"],
    "db": "ride.json",
    "schema_urls": {
      "apartment_search": "https://i.imgur.com/yICteJ1.jpg"
    },
    "instructions": {
        "User": {
            "completion_requirements": ["The MTurk Assistant says you can end the conversation."],
            "completion_questions": ["Did the assistant stay calm and helpful throughout the dialogue?"],
            "task_descriptions": ["Follow the instructions and comments of the MTurk bot. Do not end the dialogue before the MTurk bot (not the assistant) has told you to do so. "],
            "linear_guide": [
              "You are looking for your dream apartment! You take out your phone and open you personal AI assistant app to find out what apartments are for sale. Say 'hello' to your AI Assistant.",
              "Imagine what your ideal apartment would look like (number of rooms, balcony, elevator, etc.) and describe it to the assistant.",
              null,
              null,
              "Think of some property of your dream apartment that it definitely should NOT have. Tell the assistant about that.",
              null,
              "Say something that refers to the very beginning of this conversation. Be creative!",
              null,
              "Now completely change your mind about what you're looking for.",
              null,
              null,
              "Make an impossible request, or a joke.",
              "Great! Now bring the conversation to a natural close."
            ]
        },
        "Wizard": {
            "task_description": "Follow the flow charts and help the user. (You can find the single-task video tutorial under https://youtu.be/USrWF1ZyNWw, in case you want to watch it again.)",
            "completion_requirements": ["The user has said goodbye."],
            "completion_questions": [
              "Did the user change his/her mind about what he/she wants at any time?",
              "Did the user become aggressive or annoyed during the dialogue? (Note: some users may be instructed to be annoying.)",
              "Where you unsure about what to do at any time? If yes, send us a mail and let us know how we can improve the task.",
              "Do you think this user was especially creative in his/her queries?"
            ]
        }
    }
}
